Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/Generated_Source/PSoC5/ADC_DELSIG.c
/*******************************************************************************
* File Name: ADC_DELSIG.c
* Version 3.30
*
* Description:
*  This file provides the source code to the API for the Delta-Sigma ADC
*  Component.
*
* Note:
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "ADC_DELSIG.h"

#if(ADC_DELSIG_DEFAULT_INTERNAL_CLK)
    #include "ADC_DELSIG_theACLK.h"
#endif /* ADC_DELSIG_DEFAULT_INTERNAL_CLK */

#include "ADC_DELSIG_Ext_CP_Clk.h"

#if(ADC_DELSIG_DEFAULT_INPUT_MODE)
    #include "ADC_DELSIG_AMux.h"
#endif /* ADC_DELSIG_DEFAULT_INPUT_MODE */


/***************************************
* Global data allocation
***************************************/

/* Software flag for checking conversion completed or not */
volatile uint8 ADC_DELSIG_convDone = 0u;

/* Software flag to stop conversion for single sample conversion mode
*   with resolution above 16 bits 
*/
volatile uint8 ADC_DELSIG_stopConversion = 0u;

/* To run the initialization block only at the start up */
uint8 ADC_DELSIG_initVar = 0u;

/* To check whether ADC started or not before switching the configuration */
volatile uint8 ADC_DELSIG_started = 0u;

/* Flag to hold ADC config number. By default active config is 1. */
volatile uint8 ADC_DELSIG_Config = 1u;

volatile int32 ADC_DELSIG_Offset = 0;
volatile int32 ADC_DELSIG_CountsPerVolt;


/***************************************
* Local data allocation
***************************************/

/* The array with precalculated gain compensation coefficients */
static ADC_DELSIG_GCOR_STRUCT ADC_DELSIG_gcor[ADC_DELSIG_DEFAULT_NUM_CONFIGS];



/***************************************
* Forward function references
***************************************/
static void ADC_DELSIG_InitConfig(uint8 config) ;
static void ADC_DELSIG_GainCompensation(uint8 inputRange, uint16 idealDecGain, uint16 idealOddDecGain, 
                            uint8 resolution, uint8 config) ;
static void ADC_DELSIG_SetDSMRef0Reg(uint8 value) ;


/******************************************************************************
* Function Name: ADC_DELSIG_Init
*******************************************************************************
*
* Summary:
*  Initialize component's parameters to the parameters set by user in the
*  customizer of the component placed onto schematic. Usually called in
* ADC_DELSIG_Start().
*
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_DELSIG_Init(void) 
{

    ADC_DELSIG_Config = 1u;
    ADC_DELSIG_convDone = 0u;

    ADC_DELSIG_Ext_CP_Clk_SetMode(CYCLK_DUTY);

    /* This is only valid if there is an internal clock */
    #if(ADC_DELSIG_DEFAULT_INTERNAL_CLK)
        ADC_DELSIG_theACLK_SetMode(CYCLK_DUTY);
    #endif /* ADC_DELSIG_DEFAULT_INTERNAL_CLK */

    #if(ADC_DELSIG_IRQ_REMOVE == 0u)
        /* Set interrupt priority */
        CyIntSetPriority(ADC_DELSIG_INTC_NUMBER, ADC_DELSIG_INTC_PRIOR_NUMBER);
    #endif   /* End ADC_DELSIG_IRQ_REMOVE */

    /* Init static registers with common configuration */
    ADC_DELSIG_DSM_DEM0_REG    = ADC_DELSIG_CFG1_DSM_DEM0;
    ADC_DELSIG_DSM_DEM1_REG    = ADC_DELSIG_CFG1_DSM_DEM1;
    ADC_DELSIG_DSM_MISC_REG    = ADC_DELSIG_CFG1_DSM_MISC;
    ADC_DELSIG_DSM_CLK_REG    |= ADC_DELSIG_CFG1_DSM_CLK;
    ADC_DELSIG_DSM_REF1_REG    = ADC_DELSIG_CFG1_DSM_REF1;

    ADC_DELSIG_DSM_OUT0_REG    = ADC_DELSIG_CFG1_DSM_OUT0;
    ADC_DELSIG_DSM_OUT1_REG    = ADC_DELSIG_CFG1_DSM_OUT1;

    ADC_DELSIG_DSM_CR0_REG     = ADC_DELSIG_CFG1_DSM_CR0;
    ADC_DELSIG_DSM_CR1_REG     = ADC_DELSIG_CFG1_DSM_CR1;
#if(ADC_DELSIG_MI_ENABLE != 0u) /* Enable Modulator Input */
    ADC_DELSIG_DSM_CR3_REG     |= ADC_DELSIG_DSM_MODBIT_EN;
#else
    ADC_DELSIG_DSM_CR3_REG     = ADC_DELSIG_CFG1_DSM_CR3;
#endif /* ADC_DELSIG_MI_ENABLE != 0u*/    
    ADC_DELSIG_DSM_CR8_REG     = ADC_DELSIG_CFG1_DSM_CR8;
    ADC_DELSIG_DSM_CR9_REG     = ADC_DELSIG_CFG1_DSM_CR9;
    ADC_DELSIG_DSM_CR13_REG    = ADC_DELSIG_CFG1_DSM_CR13;

    ADC_DELSIG_DEC_SR_REG      = ADC_DELSIG_CFG1_DEC_SR;

    /* Calculate Gain compensation coefficients for all configurations */
    ADC_DELSIG_GainCompensation(ADC_DELSIG_CFG1_INPUT_RANGE,
                                      ADC_DELSIG_CFG1_IDEAL_DEC_GAIN,
                                      ADC_DELSIG_CFG1_IDEAL_ODDDEC_GAIN,
                                      ADC_DELSIG_CFG1_RESOLUTION,
                                      ADC_DELSIG_CFG1);
    #if(ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1)
        ADC_DELSIG_GainCompensation(ADC_DELSIG_CFG2_INPUT_RANGE,
                                          ADC_DELSIG_CFG2_IDEAL_DEC_GAIN,
                                          ADC_DELSIG_CFG2_IDEAL_ODDDEC_GAIN,
                                          ADC_DELSIG_CFG2_RESOLUTION,
                                          ADC_DELSIG_CFG2);
    #endif /* ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1 */
    #if(ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2)
        ADC_DELSIG_GainCompensation(ADC_DELSIG_CFG3_INPUT_RANGE,
                                          ADC_DELSIG_CFG3_IDEAL_DEC_GAIN,
                                          ADC_DELSIG_CFG3_IDEAL_ODDDEC_GAIN,
                                          ADC_DELSIG_CFG3_RESOLUTION,
                                          ADC_DELSIG_CFG3);
    #endif /* ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2 */
    #if(ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3)
        ADC_DELSIG_GainCompensation(ADC_DELSIG_CFG4_INPUT_RANGE,
                                          ADC_DELSIG_CFG4_IDEAL_DEC_GAIN,
                                          ADC_DELSIG_CFG4_IDEAL_ODDDEC_GAIN,
                                          ADC_DELSIG_CFG4_RESOLUTION,
                                          ADC_DELSIG_CFG4);
    #endif /* ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3 */

    /* Set GCOR register for config1 */
    ADC_DELSIG_DEC_GVAL_REG = ADC_DELSIG_gcor[ADC_DELSIG_Config - 1u].gval;
    CY_SET_REG16(ADC_DELSIG_DEC_GCOR_16B_PTR, ADC_DELSIG_gcor[ADC_DELSIG_Config - 1u].gcor);

