Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/Generated_Source/PSoC5/ADC_DELSIG.c
    /* Initialize the registers with default customizer settings for config1 */
    ADC_DELSIG_InitConfig(ADC_DELSIG_Config);
}


/******************************************************************************
* Function Name: ADC_DELSIG_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC_DELSIG_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC_DELSIG_Config;
    
    /* Enable active mode power for ADC */
    ADC_DELSIG_PWRMGR_DEC_REG |= ADC_DELSIG_ACT_PWR_DEC_EN;
    ADC_DELSIG_PWRMGR_DSM_REG |= ADC_DELSIG_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC_DELSIG_STBY_PWRMGR_DEC_REG |= ADC_DELSIG_STBY_PWR_DEC_EN;
    ADC_DELSIG_STBY_PWRMGR_DSM_REG |= ADC_DELSIG_STBY_PWR_DSM_EN;

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_DELSIG_RESET_CR4_REG |= ADC_DELSIG_IGNORE_PRESA1;
    ADC_DELSIG_RESET_CR5_REG |= ADC_DELSIG_IGNORE_PRESA2;

    ADC_DELSIG_DSM_CR17_REG |= (ADC_DELSIG_DSM_EN_BUF_VREF | ADC_DELSIG_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC_DELSIG_CFG1_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) || \
          (ADC_DELSIG_CFG1_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32)) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC_DELSIG_CFG2_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||  \
           (ADC_DELSIG_CFG2_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC_DELSIG_CFG3_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||  \
           (ADC_DELSIG_CFG3_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC_DELSIG_CFG4_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) || \
           (ADC_DELSIG_CFG4_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC_DELSIG_CFG1_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||
             (ADC_DELSIG_CFG1_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC_DELSIG_CFG2_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||
             (ADC_DELSIG_CFG2_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC_DELSIG_CFG3_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||
             (ADC_DELSIG_CFG3_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC_DELSIG_CFG4_REFERENCE == ADC_DELSIG_EXT_REF_ON_P03) ||
             (ADC_DELSIG_CFG4_REFERENCE == ADC_DELSIG_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC_DELSIG_DSM_CR17_REG &= (uint8)~ADC_DELSIG_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC_DELSIG_CFG1_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC_DELSIG_CFG2_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF)) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC_DELSIG_CFG3_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF)) || \
         ((ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC_DELSIG_CFG4_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC_DELSIG_CFG1_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF) &&
            ((ADC_DELSIG_CFG1_REFERENCE != ADC_DELSIG_EXT_REF_ON_P03) &&
             (ADC_DELSIG_CFG1_REFERENCE != ADC_DELSIG_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC_DELSIG_CFG2_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF) &&
             ((ADC_DELSIG_CFG2_REFERENCE != ADC_DELSIG_EXT_REF_ON_P03) &&
             (ADC_DELSIG_CFG2_REFERENCE != ADC_DELSIG_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC_DELSIG_CFG3_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF) &&
             ((ADC_DELSIG_CFG3_REFERENCE != ADC_DELSIG_EXT_REF_ON_P03) &&
             (ADC_DELSIG_CFG3_REFERENCE != ADC_DELSIG_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC_DELSIG_CFG4_INPUT_RANGE == ADC_DELSIG_IR_VSSA_TO_2VREF) &&
             ((ADC_DELSIG_CFG4_REFERENCE != ADC_DELSIG_EXT_REF_ON_P03) &&
             (ADC_DELSIG_CFG4_REFERENCE != ADC_DELSIG_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC_DELSIG_DSM_REF0_REG |= ADC_DELSIG_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_DELSIG_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_DELSIG_RESET_CR4_REG &= (uint8)~ADC_DELSIG_IGNORE_PRESA1;
    ADC_DELSIG_RESET_CR5_REG &= (uint8)~ADC_DELSIG_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC_DELSIG_PUMP_CR1_REG  |= ( ADC_DELSIG_PUMP_CR1_CLKSEL | ADC_DELSIG_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC_DELSIG_DSM_CR2_REG = ADC_DELSIG_CFG1_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC_DELSIG_DEFAULT_INTERNAL_CLK)
        ADC_DELSIG_PWRMGR_CLK_REG |= ADC_DELSIG_ACT_PWR_CLK_EN;
        ADC_DELSIG_STBY_PWRMGR_CLK_REG |= ADC_DELSIG_STBY_PWR_CLK_EN;
    #endif /* ADC_DELSIG_DEFAULT_INTERNAL_CLK */

    /* Enable the active and alternate active power for charge pump clock */
    ADC_DELSIG_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_DELSIG_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_DELSIG_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_DELSIG_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC_DELSIG_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC_DELSIG_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC_DELSIG_INTC_NUMBER);
    #endif   /* End ADC_DELSIG_IRQ_REMOVE */

