Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/Generated_Source/PSoC5/ADC_DELSIG.c
    return ((int32)result);
}


/*******************************************************************************
* Function Name: ADC_DELSIG_SetOffset
********************************************************************************
*
* Summary:
*  Sets the ADC offset which is used by the functions ADC_CountsTo_uVolts, 
*  ADC_CountsTo_mVolts, and ADC_CountsTo_Volts to subtract the offset from the 
*  given reading before calculating the voltage conversion.
*
* Parameters:
*  int32:  This value is a measured value when the inputs are shorted or 
*          connected to the same input voltage.
*
* Return:
*  None
*
* Global variables:
*  ADC_DELSIG_Offset:  Modified to set the user provided offset. This
*  variable is used for offset calibration purpose.
*
* Side Effects:
*  Affects the ADC_DELSIG_CountsTo_Volts,
*  ADC_DELSIG_CountsTo_mVolts, ADC_DELSIG_CountsTo_uVolts functions
*  by subtracting the given offset.
*
*******************************************************************************/
void ADC_DELSIG_SetOffset(int32 offset) 
{

    ADC_DELSIG_Offset = offset;
}


/*******************************************************************************
* Function Name: ADC_DELSIG_SetGain
********************************************************************************
*
* Summary:
*  Sets the ADC gain in counts per volt for the voltage conversion
*  functions below. This value is set by default by the reference and
*  input range settings. It should only be used to further calibrate the
*  ADC with a known input or if an external reference is used. This
*  function may also be used to calibrate an entire signal chain, not
*  just the ADC.
*
* Parameters:
*  int32: ADC gain in counts per volt.
*
* Return:
*  None
*
* Global variables:
*  ADC_DELSIG_CountsPerVolt:  modified to set the ADC gain in counts
*   per volt.
*
* Side Effects:
*  Affects the ADC_DELSIG_CountsTo_Volts,
*  ADC_DELSIG_CountsTo_mVolts, ADC_DELSIG_CountsTo_uVolts functions
*  supplying the correct conversion between ADC counts and voltage.
*
*******************************************************************************/
void ADC_DELSIG_SetGain(int32 adcGain) 
{
    ADC_DELSIG_CountsPerVolt = adcGain;
}


/*******************************************************************************
* Function Name: ADC_DELSIG_CountsTo_mVolts
********************************************************************************
*
* Summary:
*  Converts the ADC counts output to mVolts as a 16-bit integer. For
*  example, if the ADC measured 0.534 volts, the return value would
*  be 534 mVolts.
*
* Parameters:
*  int32: adcCounts Result from the ADC conversion.
*
* Return:
*  int16:  Result in mVolts
*
* Global variables:
*  ADC_DELSIG_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_DELSIG_Offset:  Used as the offset while converting ADC counts
*   to mVolts.
*
*******************************************************************************/
int16 ADC_DELSIG_CountsTo_mVolts(int32 adcCounts) 
{

    int16 mVolts;

    /* Convert adcCounts to the right align if left option selected */
    #if(ADC_DELSIG_CFG1_DEC_DIV != 0)
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG1)
        {
            adcCounts /= ADC_DELSIG_CFG1_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG1_DEC_DIV */
    #if((ADC_DELSIG_CFG2_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG2)
        {
            adcCounts /= ADC_DELSIG_CFG2_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */
    #if((ADC_DELSIG_CFG3_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG3)
        {
            adcCounts /= ADC_DELSIG_CFG3_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */
    #if((ADC_DELSIG_CFG4_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG4)
        {
            adcCounts /= ADC_DELSIG_CFG4_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */

    /* Subtract ADC offset */
    adcCounts -= ADC_DELSIG_Offset;

    mVolts = (int16)(( adcCounts * ADC_DELSIG_1MV_COUNTS ) / ADC_DELSIG_CountsPerVolt) ;

    return(mVolts);
}


/*******************************************************************************
* Function Name: ADC_DELSIG_CountsTo_Volts
********************************************************************************
*
* Summary:
*  Converts the ADC output to Volts as a floating point number. For
*  example, if the ADC measure a voltage of 1.2345 Volts, the
*  returned result would be +1.2345 Volts.
*
* Parameters:
*  int32 adcCounts:  Result from the ADC conversion.
*
* Return:
*  float32: Result in Volts
*
* Global variables:
*  ADC_DELSIG_CountsPerVolt:  used to convert to Volts.
*  ADC_DELSIG_Offset:  Used as the offset while converting ADC counts
*   to Volts.
*
*******************************************************************************/
float32 ADC_DELSIG_CountsTo_Volts(int32 adcCounts) 
{

    float32 Volts;

    /* Convert adcCounts to the right align if left option selected */
    #if(ADC_DELSIG_CFG1_DEC_DIV != 0)
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG1)
        {
            adcCounts /= ADC_DELSIG_CFG1_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG1_DEC_DIV */
    #if((ADC_DELSIG_CFG2_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 1))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG2)
        {
            adcCounts /= ADC_DELSIG_CFG2_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */
    #if((ADC_DELSIG_CFG3_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 2))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG3)
        {
            adcCounts /= ADC_DELSIG_CFG3_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */
    #if((ADC_DELSIG_CFG4_DEC_DIV != 0) && (ADC_DELSIG_DEFAULT_NUM_CONFIGS > 3))
        if(ADC_DELSIG_Config == ADC_DELSIG_CFG4)
        {
            adcCounts /= ADC_DELSIG_CFG4_DEC_DIV;
        }
    #endif /* ADC_DELSIG_CFG2_DEC_DIV */

    /* Subtract ADC offset */
    adcCounts -= ADC_DELSIG_Offset;

