Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/Generated_Source/PSoC5/ADC_DELSIG.c
        /* Add two values */
		normalised = (int32)idealDecGain + ((int32)flash * 32);
        gcorTmp = (uint32)normalised * (uint32)idealOddDecGain;
        gcorValue = (uint16)(gcorTmp / ADC_DELSIG_IDEAL_GAIN_CONST);

        if (resolution < (ADC_DELSIG_MAX_GVAL - 1u))
        {
            gcorValue = (gcorValue >> (ADC_DELSIG_MAX_GVAL - (resolution + 1u)));
            ADC_DELSIG_gcor[config - 1u].gval = (resolution + 1u);
        }
        else
        {
            /* Use all 16 bits */
            ADC_DELSIG_gcor[config - 1u].gval = ADC_DELSIG_MAX_GVAL;
        }

        /* Save the gain correction register value */
        ADC_DELSIG_gcor[config - 1u].gcor = gcorValue;
    }
    else
    {
        /* Halt CPU in debug mode if config is out of valid range */
        CYASSERT(0u != 0u);
    }
}


/******************************************************************************
* Function Name: ADC_DELSIG_SetDSMRef0Reg(uint8)
******************************************************************************
*
* Summary:
*  This API sets the DSM_REF0 register. This is written for internal use.
*
* Parameters:
*  value:  Value to be written to DSM_REF0 register.
*
* Return:
*  None
*
******************************************************************************/
static void ADC_DELSIG_SetDSMRef0Reg(uint8 value) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_DELSIG_RESET_CR4_REG |= (ADC_DELSIG_IGNORE_PRESA1 | ADC_DELSIG_IGNORE_PRESD1);
    ADC_DELSIG_RESET_CR5_REG |= (ADC_DELSIG_IGNORE_PRESA2 | ADC_DELSIG_IGNORE_PRESD2);
    ADC_DELSIG_DSM_REF0_REG = value;

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_DELSIG_PRES_DELAY_TIME);
    /* Enable the press circuit */
    ADC_DELSIG_RESET_CR4_REG &= (uint8)~(ADC_DELSIG_IGNORE_PRESA1 | ADC_DELSIG_IGNORE_PRESD1);
    ADC_DELSIG_RESET_CR5_REG &= (uint8)~(ADC_DELSIG_IGNORE_PRESA2 | ADC_DELSIG_IGNORE_PRESD2);

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_DELSIG_Read8
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int8:  ADC result.
*
*******************************************************************************/
int8 ADC_DELSIG_Read8(void) 
{
    int8 result;

    /* Clear pending conversion done status */
    ADC_DELSIG_DEC_SR_REG |= ADC_DELSIG_DEC_INTR_CLEAR;
    ADC_DELSIG_StartConvert();
    (void)ADC_DELSIG_IsEndConversion(ADC_DELSIG_WAIT_FOR_RESULT);
     result = ADC_DELSIG_GetResult8();
    ADC_DELSIG_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_DELSIG_Read16
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*   void
*
* Return:
*  int16:  ADC result.
*
*******************************************************************************/
int16 ADC_DELSIG_Read16(void) 
{
    int16 result;

    /* Clear pending conversion done status */
    ADC_DELSIG_DEC_SR_REG |= ADC_DELSIG_DEC_INTR_CLEAR;
    ADC_DELSIG_StartConvert();
    (void)ADC_DELSIG_IsEndConversion(ADC_DELSIG_WAIT_FOR_RESULT);
     result = ADC_DELSIG_GetResult16();
    ADC_DELSIG_StopConvert();
    
     return(result);
}


/*******************************************************************************
* Function Name: ADC_DELSIG_Read32
********************************************************************************
*
* Summary:
*  This function simplifies getting results from the ADC when only a
*  single reading is required. When called, it will start ADC
*  conversions, wait for the conversion to be complete, stop ADC
*  conversion and return the result. This is a blocking function and will
*  not return until the result is ready.
*
* Parameters:
*  None
*
* Return:
*  int32: ADC result.
*
*******************************************************************************/
int32 ADC_DELSIG_Read32(void) 
{
    int32 result;
    
    /* Clear pending conversion done status */
    ADC_DELSIG_DEC_SR_REG |= ADC_DELSIG_DEC_INTR_CLEAR;
    ADC_DELSIG_StartConvert();
    (void)ADC_DELSIG_IsEndConversion(ADC_DELSIG_WAIT_FOR_RESULT);
     result = ADC_DELSIG_GetResult32();
    ADC_DELSIG_StopConvert();
    
     return(result);
}


/* [] END OF FILE */
